src/test/resources/org/lockss/ws/hasher/hashRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/HasherService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://hasher.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:hash>
            <hasherParams>
                <auId>org|lockss|plugin|pensoft|oai|PensoftOaiPlugin&amp;au_oai_date~2017&amp;au_oai_set~africaninvertebrates&amp;base_url~https%3A%2F%2Fafricaninvertebrates%2Epensoft%2Enet%2F</auId>
            </hasherParams>
        </service:hash>
    </soapenv:Body>
</soapenv:Envelope>
